pages/6_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Rockin' RegEx</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Rockin' RegEx</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-LinuxIntro">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Linux users in large organisations frequently have to handle large sets of data. 
<ul class="org-ul">
<li>A security analyst might be trying to detect unauthorised access to a bank's network by looking through log files containing millions of lines.
</li>
<li>A software engineer at a car manufacturer might be trying to track a bug and need to pick out specific lines of code from a program contining thousands of lines of code.
</li>
<li>A teacher might be trying to kill a misbehaving process running on their MacBook, and need to find it.
</li>
</ul>
</li>
<li>Whenever there is a large amount of data, manually pouring through all of it can be a time-consuming (or even impossible) task where there are more than a few hundred items. 
</li>
<li>To help solve these types of problem, Computer Scientists use <a href="https://en.wikipedia.org/wiki/Regular_expression">Regular Expressions</a> to help pick out just the data they want.
</li>
<li>Today, we'll learn to use this incredibly powerful feature. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://regexone.com">RexExOne.com</a> have produced a superb interactive learning resource to get to grips with <b>regular expressions</b>. 
</li>
<li>Use the links below to work through exercises 1-4 in a new tab.
</li>
<li>Note down the answers to the problems, as these form the basis of your badge task for this lesson.
<ol class="org-ol">
<li><a href="https://regexone.com/lesson/introduction_abcs">Introduction to regEx</a>
</li>
<li><a href="https://regexone.com/lesson/letters_and_digits">The 123s</a>
</li>
<li><a href="https://regexone.com/lesson/wildcards_dot">The dot</a>
</li>
<li><a href="https://regexone.com/lesson/matching_characters">Matching characters</a>
</li>
</ol>
</li>
<li>When you're done, you should be able to create regular expressions to search for things in most circumstances.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 code">
<h3 id="sec-1-3">Learn It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Lots of programs in Linux support regular expressions. 
</li>
<li>One example is <a href="https://en.wikipedia.org/wiki/Grep">grep</a>.
</li>
<li>By using these with pipes (<a href="https://www.bournetocode.com/projects/9-CS-LinuxIntro/pages/5_Lesson.html">previous lesson</a>), a computer user can quickly look through filesystems, log files, code and anything else you want. 
</li>
</ul>
<a href="#" onClick="window.open('./js/jslinux/index.html','pagename','resizable,height=700,width=700'); return false;">Click here for pop-up Linux terminal window</a><noscript>You need Javascript to use the previous link.</noscript>
<ul class="org-ul">
<li>Maybe we're like to see all the processes (programs) currently running that contain the characters, <code>pdf</code>. 
</li>
<li>First, try typing <code>ps</code> by itself, to see the 10 or so processes that are running in the virtual Linux terminal.
</li>
<li>We can pipe the results of the <code>ps</code> command through <code>grep</code> to filter out just the bits we want to see.
</li>
<li>Try typing:
</li>
</ul>
<pre class="example">
ps | grep pdf
</pre>
<ul class="org-ul">
<li>You'll see that only the processes that end <code>pdf</code> are listed. 
</li>
</ul>


<ul class="org-ul">
<li>Maybe we'd like to see a list of all the files in our current directory that contain the numbers 1 to 3 in their filename.
</li>
<li>We'll start by navigating over to where there are some files. Type: 
</li>
</ul>
<pre class="example">
cd /home/moveIt/otherDir/badge
</pre>
<ul class="org-ul">
<li>Type <code>ls</code> to see the files in the directory. There are quite a few.
</li>
<li>We can pipe the output from <code>ls</code> through <code>grep</code> to only see files that contain numbers in the range we want.
</li>
</ul>
<pre class="example">
ls | grep [1-3]
</pre>
<ul class="org-ul">
<li><b>Task:</b> Could you write an expression to only show the files ending with <code>jpg</code>.
</li>
</ul>


<ul class="org-ul">
<li>On Linux filesystems, there is a virtual device which constantly generates random characters.
</li>
<li>You can see some of the stream by typing <code>cat /dev/urandom</code>.
</li>
<li><b>NOTE:</b> This will never stop generating content! Use the keyboard shortcut, <code>Ctrl + C</code> to stop the output.
</li>
<li>It'd be nice to see if the computer ever randomly puts your initials together in one of its lines of output.
</li>
<li>This is junk data, but could just as easily be a stream of live tweets or status updates on a social network administrator's PC. To let prospective advertisers know how often their brands are mentioned on the network, <code>grep</code> could be used, and the (anonymised) messages sold to help companies market their products. 
</li>
<li>You can try seeing how often your computer's random character generator greets you with <b>hi</b>.
</li>
</ul>
<pre class="example">
cat /dev/urandom | grep hi
</pre>
<ul class="org-ul">
<li>Hopefully, you'll have spotted that any program that produces an output (e.g. <code>ls</code>, <code>cat</code>, <code>pwd</code>, <code>cat</code>, <code>ps</code> and others) can all be piped through <code>grep</code> to sift out relevant data. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Badge It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><b>Silver:</b> Complete lessons 1-4 on the <a href="https://regexone.com">RexExOne.com</a> site. Write your solutions for each problem into a text file, and upload them to <a href="https://www.BourneToLearn.com">https://www.BourneToLearn.com</a> to collect the badge.
</li>
<li><b>Gold:</b> Complete lessons 5-6, and upload your solutions.
</li>
<li><b>Platinum:</b> Complete lessons 7-9, and upload your solutions.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
